import React from 'react';
import './AboutPage.css';
import ScrollToTopButton from '../scrollButton/ScrollToTopButton';

const AboutPage = () => {
    return (
        <div className='aboutPage'>
            <header>
                <h1>Про нас</h1>
            </header>

            <div className='blocks-sections'>
            <section className="about">
                <h2>Хто ми?</h2>
                <p>Компанія BAS - Bussines Automation Software - це провідна IT-компанія в Україні, яка спеціалізується на розробці програмного забезпечення для автоматизації бізнес-процесів. Наша місія - допомогти компаніям підвищити ефективність роботи за допомогою інноваційних технологій.</p>
                <p>Ми пропонуємо індивідуальний підхід до кожного клієнта, розробляємо рішення, які відповідають їхнім потребам і бюджету. Наша команда експертів готова надати вам високоякісний сервіс і підтримку на кожному етапі проекту.</p>
            </section>

            <section className="team">
                <h2>Наша команда</h2>
                <p>Наша команда складається з висококваліфікованих та талановитих фахівців, які мають багаторічний досвід у сфері програмування та автоматизації бізнесу. Ми постійно вдосконалюємо свої навички та стежимо за останніми технологічними тенденціями, щоб надавати нашим клієнтам найкращі рішення.</p>
            </section>

            <section className="values">
                <h2>Наші цінності</h2>
                <ul>
                    <li>Якість - ми прагнемо до найвищих стандартів якості в усіх аспектах нашої роботи.</li>
                    <li>Інновації - ми постійно вдосконалюємося і впроваджуємо новаторські рішення для досягнення максимального ефекту.</li>
                    <li>Прозорість - ми дотримуємося принципу відкритості та чесності у всіх наших взаємодіях з клієнтами та співробітниками.</li>
                    <li>Співпраця - ми віримо у важливість ефективної комунікації та співпраці для досягнення спільних цілей.</li>
                </ul>
            </section>

            </div>
           
            <ScrollToTopButton />
        </div>
    );
};

export default AboutPage;
